In [1]:
#!conda install -y pymysql
#!conda install -y sqlalchemy
#!conda install -y anaconda pandasql

In [2]:
import pandas as pd
import numpy as np

from pandasql import sqldf

import pymysql
from sqlalchemy import create_engine
from sqlalchemy import text

from sklearn.metrics import confusion_matrix, accuracy_score, precision_score, recall_score, ConfusionMatrixDisplay
from sklearn.metrics import classification_report, f1_score, cohen_kappa_score

import getpass

In [3]:
password = getpass.getpass()

········

In [4]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)
data = pd.read_sql_query('SELECT * FROM rental', engine)
data.shape

(16044, 7)

In [5]:
def rentals_month(year:int, month:int):
    #This function collects a column from Sakila database, a year and a month
    #and returns a dataframe with rental columns from Sakila filters by the
    #specified year and month. 
    params_def = (year, month)
    query = 'SELECT * FROM rental WHERE YEAR(rental_date) = %s AND MONTH(rental_date) = %s' % params_def
    data_2 = pd.read_sql_query(query, engine)
    return data_2
    
rents_2005_05 = rentals_month(2005, 5)
rents_2005_06 = rentals_month(2005, 6)
#def rentals_month (year = int, month = int):
#    query_def = f'select * from rental where YEAR(rental_date)={year} and MONTH(rental_date)={month};'
#    result = pd.read_sql_query(query_def,engine)
#    return result
#rentals_month(2005, 5)

In [6]:
rents_2005_05.columns

Index(['rental_id', 'rental_date', 'inventory_id', 'customer_id',
       'return_date', 'staff_id', 'last_update'],
      dtype='object')

In [31]:
rents_2005_05.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [42]:
rents_2005_05.groupby('customer_id').agg({"rental_id":'count'}).rename(columns={"rental_id":"rentals_2005_05"}).reset_index()

     customer_id  rentals_2005_05
0              1                2
1              2                1
2              3                2
3              5                3
4              6                3
..           ...              ...
515          594                4
516          595                1
517          596                6
518          597                2
519          599                1

[520 rows x 2 columns]

In [44]:
year = rents_2005_05['rental_date'].dt.year.unique().astype(str)[0]
month = rents_2005_05['rental_date'].dt.month.unique().astype(str)[0]

print(month)
#I was just confirming this for the function

5

In [45]:
def rental_count_month(df: pd.DataFrame):
    #This function gets as an input the output dataframe from function rentals_months and add the total rents per customer id
    df_2 = df.copy()
    year = df_2['rental_date'].dt.year.unique().astype(str)[0]
    month = df_2['rental_date'].dt.month.unique().astype(str)[0]
    new_column_name = "rentals_" + year + "_" + month
    result = df_2.groupby('customer_id').agg({"rental_id":'count'}).rename(columns={"rental_id": new_column_name }).reset_index()
    return result

In [51]:
rental_count_2005_05 = rental_count_month(rents_2005_05)
display(rental_count_2005_05)
rental_count_2005_06= rental_count_month(rents_2005_06)
display(rental_count_2005_06)

     customer_id  rentals_2005_5
0              1               2
1              2               1
2              3               2
3              5               3
4              6               3
..           ...             ...
515          594               4
516          595               1
517          596               6
518          597               2
519          599               1

[520 rows x 2 columns]

     customer_id  rentals_2005_6
0              1               7
1              2               1
2              3               4
3              4               6
4              5               5
..           ...             ...
585          595               2
586          596               2
587          597               3
588          598               1
589          599               4

[590 rows x 2 columns]

In [61]:
def compare_rentals(df1: pd.DataFrame, df2: pd.DataFrame):
    df_1 = df1.copy()
    df_2 = df2.copy()
    df_def = df_1.merge(df_2, how='outer')
    df_def = df_def.fillna(0)
    #display(df_def.head())
    df_def['rentals_difference'] = df_def.iloc[:,2] - df_def.iloc[:,1]
    return df_def
compare_rentals(rental_count_2005_05,rental_count_2005_06)

     customer_id  rentals_2005_5  rentals_2005_6  rentals_difference
0              1             2.0             7.0                 5.0
1              2             1.0             1.0                 0.0
2              3             2.0             4.0                 2.0
3              5             3.0             5.0                 2.0
4              6             3.0             4.0                 1.0
..           ...             ...             ...                 ...
593          583             0.0             6.0                 6.0
594          585             0.0             4.0                 4.0
595          591             0.0             3.0                 3.0
596          592             0.0             5.0                 5.0
597          598             0.0             1.0                 1.0

[598 rows x 4 columns]